Revit 2024 API
AnalysisDisplayColorEntry Methods
The AnalysisDisplayColorEntry type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
HasValue
 Check if color entry has associated value.
IsEqual
 Compare color entries.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace